{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyMTJajwfTZBtib2wACfd19e"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["**ЗАДАНИЕ**⃧\n","\n","Напишите программу, которая запрашивает у пользователя три целых числа и вычисляет среднее арифметическое этих чисел.\n","\n","Подсказка:\n","\n","Среднее арифметическое рассчитывается как сумма чисел, делённая на их количество."],"metadata":{"id":"-0F-wqM58r8T"}},{"cell_type":"markdown","source":["***Как это задание выполнила бы я сама***"],"metadata":{"id":"bAVTH-q9PKw_"}},{"cell_type":"code","source":["def average_of_three(num1, num2, num3):\n","    return (num1 + num2 + num3) / 3\n","\n","def num_input(num):\n","    return int(input(num))\n","\n","num1 = num_input(\"Введите первое число: \")\n","num2 = num_input(\"Введите второе число: \")\n","num3 = num_input(\"Введите третье число: \")\n","\n","print(\"Среднее арифметическое:\", average_of_three(num1, num2, num3))"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"9_JzR5KPQoIY","executionInfo":{"status":"ok","timestamp":1759431068206,"user_tz":-180,"elapsed":3732,"user":{"displayName":"Anna Simakova","userId":"13296983545173945938"}},"outputId":"e7afa152-45c5-4aeb-f845-cc514fe2177f"},"execution_count":5,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите первое число: 1\n","Введите второе число: 2\n","Введите третье число: 3\n","Среднее арифметическое: 2.0\n"]}]},{"cell_type":"markdown","source":["***Как я сделала это с помощью AI***"],"metadata":{"id":"_GxbWYNDPQVV"}},{"cell_type":"code","source":["def get_number(prompt):\n","    while True:\n","        try:\n","            return float(input(prompt))\n","        except ValueError:\n","            print(\"Это не число, попробуйте ещё раз.\")\n","\n","def decimal_places(num):\n","    \"\"\"Возвращает количество знаков после запятой у числа.\"\"\"\n","    s = str(num)\n","    if '.' in s:\n","        return len(s.split('.')[1])\n","    return 0\n","\n","def average_of_three(num1, num2, num3):\n","    result = (num1 + num2 + num3) / 3\n","    # Определяем максимальное количество знаков после запятой\n","    max_decimals = max(decimal_places(num1), decimal_places(num2), decimal_places(num3))\n","    return round(result, max_decimals)\n","\n","# Ввод трёх чисел\n","num1 = get_number(\"Введите первое число: \")\n","num2 = get_number(\"Введите второе число: \")\n","num3 = get_number(\"Введите третье число: \")\n","\n","# Вычисление и вывод среднего\n","print(\"Среднее арифметическое:\", average_of_three(num1, num2, num3))"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"PYc550HOOwxZ","executionInfo":{"status":"ok","timestamp":1759430544389,"user_tz":-180,"elapsed":19230,"user":{"displayName":"Anna Simakova","userId":"13296983545173945938"}},"outputId":"2d9b2edd-22ee-4187-eb45-8ca1f9ee88f1"},"execution_count":1,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите первое число: 1,23455\n","Это не число, попробуйте ещё раз.\n","Введите первое число: 1.234543\n","Введите второе число: 3.456\n","Введите третье число: 3!\n","Это не число, попробуйте ещё раз.\n","Введите третье число: 3\n","Среднее арифметическое: 2.563514\n"]}]},{"cell_type":"markdown","source":[],"metadata":{"id":"Mcb-a38p81Z0"}}]}