{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[{"file_id":"13dOBv-cQchipDwf9fLShrOUIZV6imm2W","timestamp":1759509689257},{"file_id":"1JEBphlQBeajVzQTlgaeQF5UflY9swBYT","timestamp":1759509595454},{"file_id":"1fuc77sDPanKlTPU0ZSzzSjq-3ue-pBHC","timestamp":1759433945062},{"file_id":"12qEa5bQdiPiPm1BIfrI0bZy2CjI0JHYn","timestamp":1759433741534},{"file_id":"1Iv0GBannfMkB8ZyNIdWQz00GUNvXijxt","timestamp":1759433664306},{"file_id":"1XniNgZvvz5Ihe3jez9lhY-laxfI5oKAC","timestamp":1759433421215}],"authorship_tag":"ABX9TyMXcylIBxvEqwXvBwCulT3e"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["**ЗАДАНИЕ**⃧\n","\n","Напишите программу, которая запрашивает у пользователя три целых числа и вычисляет среднее арифметическое этих чисел.\n","\n","Подсказка:\n","\n","Среднее арифметическое рассчитывается как сумма чисел, делённая на их количество."],"metadata":{"id":"-0F-wqM58r8T"}},{"cell_type":"markdown","source":["***Как это задание выполнила бы я сама***\n","\n"],"metadata":{"id":"bAVTH-q9PKw_"}},{"cell_type":"code","source":["def average_of_three(num1, num2, num3):\n","    return (num1 + num2 + num3) / 3\n","\n","def num_input(num):\n","    return int(input(num))\n","\n","num1 = num_input(\"Введите первое число: \")\n","num2 = num_input(\"Введите второе число: \")\n","num3 = num_input(\"Введите третье число: \")\n","\n","print(\"Среднее арифметическое:\", average_of_three(num1, num2, num3))"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"9_JzR5KPQoIY","executionInfo":{"status":"ok","timestamp":1759431068206,"user_tz":-180,"elapsed":3732,"user":{"displayName":"Anna Simakova","userId":"13296983545173945938"}},"outputId":"e7afa152-45c5-4aeb-f845-cc514fe2177f"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите первое число: 1\n","Введите второе число: 2\n","Введите третье число: 3\n","Среднее арифметическое: 2.0\n"]}]},{"cell_type":"markdown","source":["***Как я сделала это с помощью AI***"],"metadata":{"id":"_GxbWYNDPQVV"}},{"cell_type":"code","source":["def get_number(prompt):\n","    while True:\n","        try:\n","            return float(input(prompt))\n","        except ValueError:\n","            print(\"Это не число, попробуйте ещё раз.\")\n","\n","def decimal_places(num):\n","    \"\"\"Возвращает количество знаков после запятой у числа.\"\"\"\n","    s = str(num)\n","    if '.' in s:\n","        return len(s.split('.')[1])\n","    return 0\n","\n","def average_of_three(num1, num2, num3):\n","    result = (num1 + num2 + num3) / 3\n","    # Определяем максимальное количество знаков после запятой\n","    max_decimals = max(decimal_places(num1), decimal_places(num2), decimal_places(num3))\n","    return round(result, max_decimals)\n","\n","# Ввод трёх чисел\n","num1 = get_number(\"Введите первое число: \")\n","num2 = get_number(\"Введите второе число: \")\n","num3 = get_number(\"Введите третье число: \")\n","\n","# Вычисление и вывод среднего\n","print(\"Среднее арифметическое:\", average_of_three(num1, num2, num3))"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"PYc550HOOwxZ","executionInfo":{"status":"ok","timestamp":1759430544389,"user_tz":-180,"elapsed":19230,"user":{"displayName":"Anna Simakova","userId":"13296983545173945938"}},"outputId":"2d9b2edd-22ee-4187-eb45-8ca1f9ee88f1"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите первое число: 1,23455\n","Это не число, попробуйте ещё раз.\n","Введите первое число: 1.234543\n","Введите второе число: 3.456\n","Введите третье число: 3!\n","Это не число, попробуйте ещё раз.\n","Введите третье число: 3\n","Среднее арифметическое: 2.563514\n"]}]},{"cell_type":"markdown","source":["#### Задача 1: Переворот строки\n","\n","Напишите программу, которая запрашивает у пользователя строку и выводит её в обратном порядке.\n","\n","**Пример:**\n","\n","```\n","Введите строку: Python\n","Результат: nohtyP\n","```"],"metadata":{"id":"UC9JaNNNiSoX"}},{"cell_type":"code","source":["def reverse_string(str):\n","  return str[::-1]\n","\n","input_str = input(\"Введите строку:\")\n","print (\"Результат:\",reverse_string(input_str))\n"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"ywz9JonXVQQK","executionInfo":{"status":"ok","timestamp":1759432539139,"user_tz":-180,"elapsed":5002,"user":{"displayName":"Anna Simakova","userId":"13296983545173945938"}},"outputId":"b781e3de-7f07-4109-a264-b60600fe46af"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите строку:!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n","Результат: !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n"]}]},{"cell_type":"markdown","source":["#### Задача 2: Подсчёт слов в предложении\n","\n","Запросите у пользователя предложение и подсчитайте количество слов в нём.\n","\n","**Пример:**\n","\n","```\n","Введите предложение: Это простое предложение\n","Количество слов: 3\n","```"],"metadata":{"id":"l4gj2ylOSndv"}},{"cell_type":"code","source":["def count_words(sentence):\n","  words = sentence.split()\n","  return len(words)\n","\n","input_sentence = str(input(\"Введите предложение:\"))\n","print(\"Количество слов\", count_words(input_sentence))"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"BJfc4YedS-cM","executionInfo":{"status":"ok","timestamp":1759432780804,"user_tz":-180,"elapsed":6639,"user":{"displayName":"Anna Simakova","userId":"13296983545173945938"}},"outputId":"084905c1-cb3d-40e1-9c63-2c04d0f27419"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите предложение:Я люблю жизнь!\n","Количество слов 3\n"]}]},{"cell_type":"markdown","source":["#### Задача 3: Замена символов\n","\n","Запросите у пользователя строку и замените все пробелы на подчёркивания.\n","\n","**Пример:**\n","\n","```\n","Введите строку: Hello World Python\n","Результат: Hello_World_Python\n","```"],"metadata":{"id":"22ZsfgdNSnwM"}},{"cell_type":"code","source":["def change_space_on_underlining(str):\n","  return str.replace(\" \",\"_\")\n","\n","input_str = str(input(\"Введите строку:\"))\n","print(\"Результат:\",change_space_on_underlining(input_str))"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"AKRFJng4VbnG","executionInfo":{"status":"ok","timestamp":1759433048770,"user_tz":-180,"elapsed":11019,"user":{"displayName":"Anna Simakova","userId":"13296983545173945938"}},"outputId":"b32f9fc3-da14-4971-b7f5-81d708aa8075"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите строку:Наша жизнь это что-то с чем-то!\n","Результат: Наша_жизнь_это_что-то_с_чем-то!\n"]}]}]}